MikroElektronika/core_packages/PIC/XC8/def/PIC16F1764/mcu.h
extern volatile DAC1CON1bits_t DAC1CON1bits __at(0x592);
// bitfield macros
#define _DAC1CON1_REF_POSN                                  0x0
#define _DAC1CON1_REF_POSITION                              0x0
#define _DAC1CON1_REF_SIZE                                  0x8
#define _DAC1CON1_REF_LENGTH                                0x8
#define _DAC1CON1_REF_MASK                                  0xFF
#define _DAC1CON1_DAC1REF0_POSN                             0x0
#define _DAC1CON1_DAC1REF0_POSITION                         0x0
#define _DAC1CON1_DAC1REF0_SIZE                             0x1
#define _DAC1CON1_DAC1REF0_LENGTH                           0x1
#define _DAC1CON1_DAC1REF0_MASK                             0x1
#define _DAC1CON1_DAC1REF1_POSN                             0x1
#define _DAC1CON1_DAC1REF1_POSITION                         0x1
#define _DAC1CON1_DAC1REF1_SIZE                             0x1
#define _DAC1CON1_DAC1REF1_LENGTH                           0x1
#define _DAC1CON1_DAC1REF1_MASK                             0x2
#define _DAC1CON1_DAC1REF2_POSN                             0x2
#define _DAC1CON1_DAC1REF2_POSITION                         0x2
#define _DAC1CON1_DAC1REF2_SIZE                             0x1
#define _DAC1CON1_DAC1REF2_LENGTH                           0x1
#define _DAC1CON1_DAC1REF2_MASK                             0x4
#define _DAC1CON1_DAC1REF3_POSN                             0x3
#define _DAC1CON1_DAC1REF3_POSITION                         0x3
#define _DAC1CON1_DAC1REF3_SIZE                             0x1
#define _DAC1CON1_DAC1REF3_LENGTH                           0x1
#define _DAC1CON1_DAC1REF3_MASK                             0x8
#define _DAC1CON1_DAC1REF4_POSN                             0x4
#define _DAC1CON1_DAC1REF4_POSITION                         0x4
#define _DAC1CON1_DAC1REF4_SIZE                             0x1
#define _DAC1CON1_DAC1REF4_LENGTH                           0x1
#define _DAC1CON1_DAC1REF4_MASK                             0x10
#define _DAC1CON1_DAC1REF5_POSN                             0x5
#define _DAC1CON1_DAC1REF5_POSITION                         0x5
#define _DAC1CON1_DAC1REF5_SIZE                             0x1
#define _DAC1CON1_DAC1REF5_LENGTH                           0x1
#define _DAC1CON1_DAC1REF5_MASK                             0x20
#define _DAC1CON1_DAC1REF6_POSN                             0x6
#define _DAC1CON1_DAC1REF6_POSITION                         0x6
#define _DAC1CON1_DAC1REF6_SIZE                             0x1
#define _DAC1CON1_DAC1REF6_LENGTH                           0x1
#define _DAC1CON1_DAC1REF6_MASK                             0x40
#define _DAC1CON1_DAC1REF7_POSN                             0x7
#define _DAC1CON1_DAC1REF7_POSITION                         0x7
#define _DAC1CON1_DAC1REF7_SIZE                             0x1
#define _DAC1CON1_DAC1REF7_LENGTH                           0x1
#define _DAC1CON1_DAC1REF7_MASK                             0x80
#define _DAC1CON1_R0_POSN                                   0x0
#define _DAC1CON1_R0_POSITION                               0x0
#define _DAC1CON1_R0_SIZE                                   0x1
#define _DAC1CON1_R0_LENGTH                                 0x1
#define _DAC1CON1_R0_MASK                                   0x1
#define _DAC1CON1_R1_POSN                                   0x1
#define _DAC1CON1_R1_POSITION                               0x1
#define _DAC1CON1_R1_SIZE                                   0x1
#define _DAC1CON1_R1_LENGTH                                 0x1
#define _DAC1CON1_R1_MASK                                   0x2
#define _DAC1CON1_R2_POSN                                   0x2
#define _DAC1CON1_R2_POSITION                               0x2
#define _DAC1CON1_R2_SIZE                                   0x1
#define _DAC1CON1_R2_LENGTH                                 0x1
#define _DAC1CON1_R2_MASK                                   0x4
#define _DAC1CON1_R3_POSN                                   0x3
#define _DAC1CON1_R3_POSITION                               0x3
#define _DAC1CON1_R3_SIZE                                   0x1
#define _DAC1CON1_R3_LENGTH                                 0x1
#define _DAC1CON1_R3_MASK                                   0x8
#define _DAC1CON1_R4_POSN                                   0x4
#define _DAC1CON1_R4_POSITION                               0x4
#define _DAC1CON1_R4_SIZE                                   0x1
#define _DAC1CON1_R4_LENGTH                                 0x1
#define _DAC1CON1_R4_MASK                                   0x10
#define _DAC1CON1_R5_POSN                                   0x5
#define _DAC1CON1_R5_POSITION                               0x5
#define _DAC1CON1_R5_SIZE                                   0x1
#define _DAC1CON1_R5_LENGTH                                 0x1
#define _DAC1CON1_R5_MASK                                   0x20
#define _DAC1CON1_R6_POSN                                   0x6
#define _DAC1CON1_R6_POSITION                               0x6
#define _DAC1CON1_R6_SIZE                                   0x1
#define _DAC1CON1_R6_LENGTH                                 0x1
#define _DAC1CON1_R6_MASK                                   0x40
#define _DAC1CON1_R7_POSN                                   0x7
#define _DAC1CON1_R7_POSITION                               0x7
#define _DAC1CON1_R7_SIZE                                   0x1
#define _DAC1CON1_R7_LENGTH                                 0x1
#define _DAC1CON1_R7_MASK                                   0x80
#define _DAC1CON1_DAC1R0_POSN                               0x0
#define _DAC1CON1_DAC1R0_POSITION                           0x0
#define _DAC1CON1_DAC1R0_SIZE                               0x1
#define _DAC1CON1_DAC1R0_LENGTH                             0x1
#define _DAC1CON1_DAC1R0_MASK                               0x1
#define _DAC1CON1_DAC1R1_POSN                               0x1
#define _DAC1CON1_DAC1R1_POSITION                           0x1
#define _DAC1CON1_DAC1R1_SIZE                               0x1
#define _DAC1CON1_DAC1R1_LENGTH                             0x1
#define _DAC1CON1_DAC1R1_MASK                               0x2
#define _DAC1CON1_DAC1R2_POSN                               0x2
#define _DAC1CON1_DAC1R2_POSITION                           0x2
#define _DAC1CON1_DAC1R2_SIZE                               0x1
#define _DAC1CON1_DAC1R2_LENGTH                             0x1
#define _DAC1CON1_DAC1R2_MASK                               0x4
#define _DAC1CON1_DAC1R3_POSN                               0x3
#define _DAC1CON1_DAC1R3_POSITION                           0x3
#define _DAC1CON1_DAC1R3_SIZE                               0x1
#define _DAC1CON1_DAC1R3_LENGTH                             0x1
#define _DAC1CON1_DAC1R3_MASK                               0x8
#define _DAC1CON1_DAC1R4_POSN                               0x4
#define _DAC1CON1_DAC1R4_POSITION                           0x4
#define _DAC1CON1_DAC1R4_SIZE                               0x1
#define _DAC1CON1_DAC1R4_LENGTH                             0x1
#define _DAC1CON1_DAC1R4_MASK                               0x10
#define _DAC1CON1_DAC1R5_POSN                               0x5
#define _DAC1CON1_DAC1R5_POSITION                           0x5
#define _DAC1CON1_DAC1R5_SIZE                               0x1
#define _DAC1CON1_DAC1R5_LENGTH                             0x1
#define _DAC1CON1_DAC1R5_MASK                               0x20
#define _DAC1CON1_DAC1R6_POSN                               0x6
#define _DAC1CON1_DAC1R6_POSITION                           0x6
#define _DAC1CON1_DAC1R6_SIZE                               0x1
#define _DAC1CON1_DAC1R6_LENGTH                             0x1
#define _DAC1CON1_DAC1R6_MASK                               0x40
#define _DAC1CON1_DAC1R7_POSN                               0x7
#define _DAC1CON1_DAC1R7_POSITION                           0x7
#define _DAC1CON1_DAC1R7_SIZE                               0x1
#define _DAC1CON1_DAC1R7_LENGTH                             0x1
#define _DAC1CON1_DAC1R7_MASK                               0x80
#define _DAC1CON1_REF0_POSN                                 0x0
#define _DAC1CON1_REF0_POSITION                             0x0
#define _DAC1CON1_REF0_SIZE                                 0x1
#define _DAC1CON1_REF0_LENGTH                               0x1
#define _DAC1CON1_REF0_MASK                                 0x1
#define _DAC1CON1_REF1_POSN                                 0x1
#define _DAC1CON1_REF1_POSITION                             0x1
#define _DAC1CON1_REF1_SIZE                                 0x1
#define _DAC1CON1_REF1_LENGTH                               0x1
#define _DAC1CON1_REF1_MASK                                 0x2
#define _DAC1CON1_REF2_POSN                                 0x2
#define _DAC1CON1_REF2_POSITION                             0x2
#define _DAC1CON1_REF2_SIZE                                 0x1
#define _DAC1CON1_REF2_LENGTH                               0x1
#define _DAC1CON1_REF2_MASK                                 0x4
#define _DAC1CON1_REF3_POSN                                 0x3
#define _DAC1CON1_REF3_POSITION                             0x3
#define _DAC1CON1_REF3_SIZE                                 0x1
#define _DAC1CON1_REF3_LENGTH                               0x1
#define _DAC1CON1_REF3_MASK                                 0x8
#define _DAC1CON1_REF4_POSN                                 0x4
#define _DAC1CON1_REF4_POSITION                             0x4
#define _DAC1CON1_REF4_SIZE                                 0x1
#define _DAC1CON1_REF4_LENGTH                               0x1
#define _DAC1CON1_REF4_MASK                                 0x10
#define _DAC1CON1_REF5_POSN                                 0x5
#define _DAC1CON1_REF5_POSITION                             0x5
#define _DAC1CON1_REF5_SIZE                                 0x1
#define _DAC1CON1_REF5_LENGTH                               0x1
#define _DAC1CON1_REF5_MASK                                 0x20
#define _DAC1CON1_REF6_POSN                                 0x6
#define _DAC1CON1_REF6_POSITION                             0x6
#define _DAC1CON1_REF6_SIZE                                 0x1
#define _DAC1CON1_REF6_LENGTH                               0x1
#define _DAC1CON1_REF6_MASK                                 0x40
#define _DAC1CON1_REF7_POSN                                 0x7
#define _DAC1CON1_REF7_POSITION                             0x7
#define _DAC1CON1_REF7_SIZE                                 0x1
#define _DAC1CON1_REF7_LENGTH                               0x1
#define _DAC1CON1_REF7_MASK                                 0x80

// Register: DAC1REFH
#define DAC1REFH DAC1REFH
extern volatile unsigned char           DAC1REFH            __at(0x593);
#ifndef _LIB_BUILD
asm("DAC1REFH equ 0593h");
#endif
// aliases
extern volatile unsigned char           DAC1CON2            __at(0x593);
#ifndef _LIB_BUILD
asm("DAC1CON2 equ 0593h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC1REF8               :1;
        unsigned DAC1REF9               :1;
        unsigned DAC1REF10              :1;
        unsigned DAC1REF11              :1;
        unsigned DAC1REF12              :1;
        unsigned DAC1REF13              :1;
        unsigned DAC1REF14              :1;
        unsigned DAC1REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC1R8                 :1;
        unsigned DAC1R9                 :1;
        unsigned DAC1R10                :1;
        unsigned DAC1R11                :1;
        unsigned DAC1R12                :1;
        unsigned DAC1R13                :1;
        unsigned DAC1R14                :1;
        unsigned DAC1R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC1REFHbits_t;
