MikroElektronika/core_packages/PIC/XC8/def/PIC16F1764/mcu.h
extern volatile T2INPPSbits_t T2INPPSbits __at(0xE19);
// bitfield macros
#define _T2INPPS_T2INPPS_POSN                               0x0
#define _T2INPPS_T2INPPS_POSITION                           0x0
#define _T2INPPS_T2INPPS_SIZE                               0x5
#define _T2INPPS_T2INPPS_LENGTH                             0x5
#define _T2INPPS_T2INPPS_MASK                               0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :5;
    };
} T2CKIPPSbits_t;
extern volatile T2CKIPPSbits_t T2CKIPPSbits __at(0xE19);
// bitfield macros
#define _T2CKIPPS_T2INPPS_POSN                              0x0
#define _T2CKIPPS_T2INPPS_POSITION                          0x0
#define _T2CKIPPS_T2INPPS_SIZE                              0x5
#define _T2CKIPPS_T2INPPS_LENGTH                            0x5
#define _T2CKIPPS_T2INPPS_MASK                              0x1F
typedef union {
    struct {
        unsigned T2INPPS                :5;
    };
} T2PPSbits_t;
extern volatile T2PPSbits_t T2PPSbits __at(0xE19);
// bitfield macros
#define _T2PPS_T2INPPS_POSN                                 0x0
#define _T2PPS_T2INPPS_POSITION                             0x0
#define _T2PPS_T2INPPS_SIZE                                 0x5
#define _T2PPS_T2INPPS_LENGTH                               0x5
#define _T2PPS_T2INPPS_MASK                                 0x1F

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
extern volatile unsigned char           T3CKIPPS            __at(0xE1A);
#ifndef _LIB_BUILD
asm("T3CKIPPS equ 0E1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3CKIPPS               :5;
    };
} T3CKIPPSbits_t;
extern volatile T3CKIPPSbits_t T3CKIPPSbits __at(0xE1A);
// bitfield macros
#define _T3CKIPPS_T3CKIPPS_POSN                             0x0
#define _T3CKIPPS_T3CKIPPS_POSITION                         0x0
#define _T3CKIPPS_T3CKIPPS_SIZE                             0x5
#define _T3CKIPPS_T3CKIPPS_LENGTH                           0x5
#define _T3CKIPPS_T3CKIPPS_MASK                             0x1F

// Register: T3GPPS
#define T3GPPS T3GPPS
extern volatile unsigned char           T3GPPS              __at(0xE1B);
#ifndef _LIB_BUILD
asm("T3GPPS equ 0E1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3GPPS                 :5;
    };
} T3GPPSbits_t;
extern volatile T3GPPSbits_t T3GPPSbits __at(0xE1B);
// bitfield macros
#define _T3GPPS_T3GPPS_POSN                                 0x0
#define _T3GPPS_T3GPPS_POSITION                             0x0
#define _T3GPPS_T3GPPS_SIZE                                 0x5
#define _T3GPPS_T3GPPS_LENGTH                               0x5
#define _T3GPPS_T3GPPS_MASK                                 0x1F

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0xE1C);
#ifndef _LIB_BUILD
asm("T4INPPS equ 0E1Ch");
#endif
// aliases
extern volatile unsigned char           T4CKIPPS            __at(0xE1C);
#ifndef _LIB_BUILD
asm("T4CKIPPS equ 0E1Ch");
#endif
extern volatile unsigned char           T4PPS               __at(0xE1C);
#ifndef _LIB_BUILD
asm("T4PPS equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :5;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0xE1C);
// bitfield macros
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x5
#define _T4INPPS_T4INPPS_LENGTH                             0x5
#define _T4INPPS_T4INPPS_MASK                               0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :5;
    };
} T4CKIPPSbits_t;
extern volatile T4CKIPPSbits_t T4CKIPPSbits __at(0xE1C);
// bitfield macros
#define _T4CKIPPS_T4INPPS_POSN                              0x0
#define _T4CKIPPS_T4INPPS_POSITION                          0x0
#define _T4CKIPPS_T4INPPS_SIZE                              0x5
#define _T4CKIPPS_T4INPPS_LENGTH                            0x5
#define _T4CKIPPS_T4INPPS_MASK                              0x1F
typedef union {
    struct {
        unsigned T4INPPS                :5;
    };
} T4PPSbits_t;
extern volatile T4PPSbits_t T4PPSbits __at(0xE1C);
// bitfield macros
#define _T4PPS_T4INPPS_POSN                                 0x0
#define _T4PPS_T4INPPS_POSITION                             0x0
#define _T4PPS_T4INPPS_SIZE                                 0x5
#define _T4PPS_T4INPPS_LENGTH                               0x5
#define _T4PPS_T4INPPS_MASK                                 0x1F

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0xE1D);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 0E1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5CKIPPS               :5;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0xE1D);
// bitfield macros
#define _T5CKIPPS_T5CKIPPS_POSN                             0x0
#define _T5CKIPPS_T5CKIPPS_POSITION                         0x0
#define _T5CKIPPS_T5CKIPPS_SIZE                             0x5
#define _T5CKIPPS_T5CKIPPS_LENGTH                           0x5
#define _T5CKIPPS_T5CKIPPS_MASK                             0x1F

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0xE1E);
#ifndef _LIB_BUILD
asm("T5GPPS equ 0E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GPPS                 :5;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0xE1E);
// bitfield macros
#define _T5GPPS_T5GPPS_POSN                                 0x0
#define _T5GPPS_T5GPPS_POSITION                             0x0
#define _T5GPPS_T5GPPS_SIZE                                 0x5
#define _T5GPPS_T5GPPS_LENGTH                               0x5
#define _T5GPPS_T5GPPS_MASK                                 0x1F

// Register: T6INPPS
#define T6INPPS T6INPPS
extern volatile unsigned char           T6INPPS             __at(0xE1F);
#ifndef _LIB_BUILD
asm("T6INPPS equ 0E1Fh");
#endif
// aliases
extern volatile unsigned char           T6CKIPPS            __at(0xE1F);
#ifndef _LIB_BUILD
asm("T6CKIPPS equ 0E1Fh");
#endif
extern volatile unsigned char           T6PPS               __at(0xE1F);
#ifndef _LIB_BUILD
asm("T6PPS equ 0E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :5;
    };
} T6INPPSbits_t;
extern volatile T6INPPSbits_t T6INPPSbits __at(0xE1F);
// bitfield macros
#define _T6INPPS_T6INPPS_POSN                               0x0
#define _T6INPPS_T6INPPS_POSITION                           0x0
#define _T6INPPS_T6INPPS_SIZE                               0x5
#define _T6INPPS_T6INPPS_LENGTH                             0x5
#define _T6INPPS_T6INPPS_MASK                               0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :5;
    };
} T6CKIPPSbits_t;
extern volatile T6CKIPPSbits_t T6CKIPPSbits __at(0xE1F);
// bitfield macros
#define _T6CKIPPS_T6INPPS_POSN                              0x0
#define _T6CKIPPS_T6INPPS_POSITION                          0x0
#define _T6CKIPPS_T6INPPS_SIZE                              0x5
#define _T6CKIPPS_T6INPPS_LENGTH                            0x5
#define _T6CKIPPS_T6INPPS_MASK                              0x1F
typedef union {
    struct {
        unsigned T6INPPS                :5;
    };
} T6PPSbits_t;
extern volatile T6PPSbits_t T6PPSbits __at(0xE1F);
// bitfield macros
#define _T6PPS_T6INPPS_POSN                                 0x0
#define _T6PPS_T6INPPS_POSITION                             0x0
#define _T6PPS_T6INPPS_SIZE                                 0x5
#define _T6PPS_T6INPPS_LENGTH                               0x5
#define _T6PPS_T6INPPS_MASK                                 0x1F

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
extern volatile unsigned char           SSPCLKPPS           __at(0xE20);
#ifndef _LIB_BUILD
asm("SSPCLKPPS equ 0E20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSPCLKPPSbits_t;
extern volatile SSPCLKPPSbits_t SSPCLKPPSbits __at(0xE20);
// bitfield macros
#define _SSPCLKPPS_SSPCLKPPS_POSN                           0x0
#define _SSPCLKPPS_SSPCLKPPS_POSITION                       0x0
#define _SSPCLKPPS_SSPCLKPPS_SIZE                           0x5
#define _SSPCLKPPS_SSPCLKPPS_LENGTH                         0x5
#define _SSPCLKPPS_SSPCLKPPS_MASK                           0x1F

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
extern volatile unsigned char           SSPDATPPS           __at(0xE21);
#ifndef _LIB_BUILD
asm("SSPDATPPS equ 0E21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPDATPPS              :5;
    };
} SSPDATPPSbits_t;
